doc/ecet.org
#+STYLE: <link rel="stylesheet" type="text/css" href="stylesheet.css" />
#+TITLE:     Error Correction Evaluation Method
#+AUTHOR:    Sriram P Chockalingam
#+EMAIL:     sriram.pc@iitb.ac.in
#+DATE:      2011-12-26 
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS: toc:2 ^:nil
#+INFOJS_OPT: view:nil toc:2 ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
In this page, we discuss the scripts and other tools used to evaluate
error correction method. In the first section, we discuss the
procedure for  evaluation methods for Illumina and 454/Ion Torrent
reads. In the second section, we discuss the tools and its usage. In
the third section, we describe the conventions used for
evaluation. The last section provides the link to download the tools.
* Evaluation method
** Evaluation method for Illumina reads
Evaluation of output from error correction method consists of
following steps, 
1. Align reads prior to correction.
2. Convert pre-correction alignment to Target Error Format (TEF).
3. Run error correction program.
4. Convert error correction output to Target Error Format (TEF).
5. Compare TEFs from steps (2) and (4) and measure Gain.

The following sub-section describe these steps.
*** Target error format (TEF)
  We use a format called target error format (TEF) to perform the
  analysis for Illumina reads. TEF represents the errors in a read as
  below: 
#+BEGIN_EXAMPLE
  readid n-errors [pos tb wb ind]+
#+END_EXAMPLE
   In the above format, the fields are described as below :
   |----------+----------------------------------------------------|
   | Fields   | Description                                        |
   |----------+----------------------------------------------------|
   | readid   | ID of the read corrected                           |
   | n-errors | Integer. Number of errors corrected in the read.   |
   | pos      | Position for fix (0 <= pos < length of the read)   |
   |----------+----------------------------------------------------|
   | tb       | true value of the base at pos.                     |
   | wb       | wrong value of the base at pos.                    |
   |          | wb should be current base at read                  |
   |          | tb,wb is one of {0,1,2,3,4,5}                      |
   |          | 0 = 'A', 1 = 'C', 2 = 'G', 3 = 'T', 5 = '-'        |
   |----------+----------------------------------------------------|
   | ind      | indicates the type of error. one of {0,1,2}        |
   |          | 0 substitution (bad char in the read at pos)  or   |
   |          | 1 deletion (missing char in the read after pos) or |
   |          | 2 insertion (extra char in the read at pos)        |
   |          |                                                    |
   |----------+----------------------------------------------------|
*** Align uncorrected reads to BWA 
# <<align-bwa>>
    - Before performing alignment, the reads are pre-processed 
      (Section [[pre-process][Pre-processing Data]]).
    - Uncorrected reads are aligned with BWA. BWA generates alignments
      in SAM format. The script sam-analysis.py
      (Section [[sam-to-tef][SAM to TEF Conversion]]) converts alignments from SAM
      to TEF . 
*** Correct reads
# <<correct-reads>>
    - Error correction program is run against the uncorrected reads. 
    - The output of error correction program is converted to the
      target error format (TEF) using the following scripts for the
      corresponding error correction program.
      |---------+----------------|
      | Program | Script         |
      |---------+----------------|
      | Coral   | coral-analy.pl |
      | HiTEC   | hitec-analy.pl |
      | Quake   | quake-analy.py |
      | ECHO    | quake-analy.py |
      |---------+----------------|
      Reptile generates output in TEF. The usage of these scripts are
      described in the Section [[tef-conversion][Conversion to TEF]].
*** Measure Gain
# <<measure-gain>>
    - The target error format files generated in the previous two
      sections, are compared using Comp2PCAlign (Section
      [[comp2pcalign][Comp2PCAlign]]), which measures Gain and Sensitivity. 

** Evaluation method for 454/Ion Torrent Reads
Evaluation consists of the following steps
1. Align reads prior to correction.
2. Construct set of Errors prior to error correction
3. Construct set of Errors post error correction
4. Measure Gain by comparing (2) and (3).
(2), (3) and (4) are done by a single script. The following sections
explain these steps.
*** Align uncorrected reads to Mosaik/TMAP
    - Before performing alignment, the reads are pre-processed as
      given in  Section [[pre-process][Pre-processing Data]].
    - For 454 reads, alignments are performed using Mosaik. For Ion
      Torrent reads, TMAP is used for alignment. Alignments are
      converted to SAM format for further processing.
*** Measure Gain
    - Script ~compute-stats.py~ 
      (Section [[ion454-tools][Corrected 454/Ion Torrent Reads Analysis]] ) measures gain for
      454/Ion Torrent Reads using the method explained in the paper.

* Tools
** Requirements
# <<tools-reqs>>
Tools used for evaluation have the following dependencies :
1. GCC C++ compiler v. 4.3
2. Perl v. 5
3. Python v. 2.7.2
4. MPI
5. mpi4py python package

No build is required for python and perl scripts. Comp2PCAlign
executable can be built by just running make in the
`tools/CompToPCAlign/' directory.

