doc/ecet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Error Correction Evaluation Method</title>
<!-- 2018-06-01 Fri 14:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sriram P Chockalingam" />
</head>
<body>
<div id="content">
<h1 class="title">Error Correction Evaluation Method</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Evaluation method</a>
<ul>
<li><a href="#sec-1-1">1.1. Evaluation method for Illumina reads</a></li>
<li><a href="#sec-1-2">1.2. Evaluation method for 454/Ion Torrent Reads</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Tools</a>
<ul>
<li><a href="#sec-2-1">2.1. Requirements</a></li>
<li><a href="#sec-2-2">2.2. Pre-processing Data</a></li>
<li><a href="#sec-2-3">2.3. Conversion to TEF</a></li>
<li><a href="#sec-2-4">2.4. SAM to TEF Conversion</a></li>
<li><a href="#sec-2-5">2.5. Comp2PCAlign</a></li>
<li><a href="#sec-2-6">2.6. Corrected 454/Ion Torrent Reads Analysis</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Procedure Conventions</a></li>
<li><a href="#sec-4">4. Download</a></li>
</ul>
</div>
</div>
<p>
In this page, we discuss the scripts and other tools used to evaluate
error correction method. In the first section, we discuss the
procedure for  evaluation methods for Illumina and 454/Ion Torrent
reads. In the second section, we discuss the tools and its usage. In
the third section, we describe the conventions used for
evaluation. The last section provides the link to download the tools.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Evaluation method</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Evaluation method for Illumina reads</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Evaluation of output from error correction method consists of
following steps, 
</p>
<ol class="org-ol">
<li>Align reads prior to correction.
</li>
<li>Convert pre-correction alignment to Target Error Format (TEF).
</li>
<li>Run error correction program.
</li>
<li>Convert error correction output to Target Error Format (TEF).
</li>
<li>Compare TEFs from steps (2) and (4) and measure Gain.
</li>
</ol>

<p>
The following sub-section describe these steps.
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Target error format (TEF)</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
We use a format called target error format (TEF) to perform the
analysis for Illumina reads. TEF represents the errors in a read as
below: 
</p>
<pre class="example">
readid n-errors [pos tb wb ind]+
</pre>
<p>
In the above format, the fields are described as below :
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Fields</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">readid</td>
<td class="left">ID of the read corrected</td>
</tr>

<tr>
<td class="left">n-errors</td>
<td class="left">Integer. Number of errors corrected in the read.</td>
</tr>

<tr>
<td class="left">pos</td>
<td class="left">Position for fix (0 &lt;= pos &lt; length of the read)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">tb</td>
<td class="left">true value of the base at pos.</td>
</tr>

<tr>
<td class="left">wb</td>
<td class="left">wrong value of the base at pos.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">wb should be current base at read</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">tb,wb is one of {0,1,2,3,4,5}</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">0 = 'A', 1 = 'C', 2 = 'G', 3 = 'T', 5 = '-'</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ind</td>
<td class="left">indicates the type of error. one of {0,1,2}</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">0 substitution (bad char in the read at pos)  or</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">1 deletion (missing char in the read after pos) or</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">2 insertion (extra char in the read at pos)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Align uncorrected reads to BWA</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Before performing alignment, the reads are pre-processed 
(Section <i>Pre-processing Data</i>).
</li>
<li>Uncorrected reads are aligned with BWA. BWA generates alignments
in SAM format. The script sam-analysis.py
(Section <i>SAM to TEF Conversion</i>) converts alignments from SAM
to TEF . 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Correct reads</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>Error correction program is run against the uncorrected reads. 
</li>
<li>The output of error correction program is converted to the
target error format (TEF) using the following scripts for the
corresponding error correction program.
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Program</th>
<th scope="col" class="left">Script</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Coral</td>
<td class="left">coral-analy.pl</td>
</tr>

<tr>
<td class="left">HiTEC</td>
<td class="left">hitec-analy.pl</td>
</tr>

<tr>
<td class="left">Quake</td>
<td class="left">quake-analy.py</td>
</tr>

<tr>
<td class="left">ECHO</td>
<td class="left">quake-analy.py</td>
</tr>
</tbody>
</table>
<p>
Reptile generates output in TEF. The usage of these scripts are
described in the Section <i>Conversion to TEF</i>.
</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Measure Gain</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>The target error format files generated in the previous two
sections, are compared using Comp2PCAlign (Section
<i>Comp2PCAlign</i>), which measures Gain and Sensitivity. 
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Evaluation method for 454/Ion Torrent Reads</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Evaluation consists of the following steps
</p>
<ol class="org-ol">
<li>Align reads prior to correction.
</li>
<li>Construct set of Errors prior to error correction
</li>
<li>Construct set of Errors post error correction
</li>
<li>Measure Gain by comparing (2) and (3).
</li>
</ol>
<p>
(2), (3) and (4) are done by a single script. The following sections
explain these steps.
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Align uncorrected reads to Mosaik/TMAP</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Before performing alignment, the reads are pre-processed as
given in  Section <i>Pre-processing Data</i>.
</li>
<li>For 454 reads, alignments are performed using Mosaik. For Ion
Torrent reads, TMAP is used for alignment. Alignments are
converted to SAM format for further processing.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Measure Gain</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Script <code>compute-stats.py</code> 
(Section <i>Corrected 454/Ion Torrent Reads Analysis</i> ) measures gain for
454/Ion Torrent Reads using the method explained in the paper.
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Tools</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Requirements</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Tools used for evaluation have the following dependencies :
</p>
<ol class="org-ol">
<li>GCC C++ compiler v. 4.3
</li>
<li>Perl v. 5
</li>
<li>Python v. 2.7.2
</li>
<li>MPI
</li>
<li>mpi4py python package
</li>
</ol>

<p>
No build is required for python and perl scripts. Comp2PCAlign
executable can be built by just running make in the
`tools/CompToPCAlign/' directory.
</p>
</div>
</div>
