doc/ecet.org
** Pre-processing Data
# <<pre-process>>
   - Short Read Archive have the reads in '.sra' format. '.sra'
     format can be converted to fastq format using the 'fastq-dump'
     tool available with NCBI SRA tool kit.
   - We use FASTA format whenever possible. To convert FASTQ to
     FASTA, the script 'fastq-converter-v2.0.pl' is used as follows.
     #+BEGIN_EXAMPLE
     $ fastq-converter-v2.0.pl fastq/ fasta/ 1
     #+END_EXAMPLE
     Here, `fastq/' directory consists of all the fastq files
     of the data-set are stored. Output is generated in the ~fasta/~ 
     directory. The last argument `1' is supplied to ignore the reads
     with `N' characters. `fastq-converter-v2.0.pl' generates unique
     ids for each of the read and inserts in the FASTA header. The
     read id is unique among all the files. These identifiers are used
     to compare the reads pre- and post-correction with corresponding
     identifiers. The order in which  `fastq-converter-v2.0.pl' does 
     the conversion is saved. The identifiers are assigned to the
     reads in this order from *0* to *n-1*, where *n* is the total
     number of reads.  For example, for SRR001665 data-set the 
     `fastq-converter-v2.0.pl' processes the fastq files in the
     following order.
     #+BEGIN_EXAMPLE
     SRR001665_2.fastq
     SRR001665.fastq
     SRR001665_1.fastq
     #+END_EXAMPLE
     Here, the first read in SRR001665\_2.fastq file gets the id *0*,
     and the last read in SRR001665\_1.fastq has the id *n-1*.
   - Some of the error correction methods use only accept FASTQ. In
     order to make sure the read ids are same for all the error
     correction methods, we use merge-fastq.py to provide
     identifiers to FASTQ files. The script merges all FASTQ in a
     given input list, so that the ids in the FASTQ can be compared
     pre- and post-correction. merge-fastq.py is run as follows:
     #+BEGIN_EXAMPLE
     $ merge-fastq.py --list=lst --outfile=all.fastq
     #+END_EXAMPLE
     where `lst' is a new line delimited file containing the paths to 
     fastq files. For example, for SRR001665 data-set the `--list'
     argument is path to a file with the following contents:
     #+BEGIN_EXAMPLE
     SRR001665_2.fastq
     SRR001665.fastq
     SRR001665_1.fastq
     #+END_EXAMPLE
     For the comparison to make sense, the order should be same as the
     order in which FASTQ converter (`fastq-converter-v2.0.pl') did
     the conversion. 
   - While pre-processing, we ignore the reads with invalid characters
     because some error correction programs can not work with
     invalid characters.
** Conversion to TEF
# <<tef-conversion>>
   Scripts for converting output to TEF are used as follows:
   1. coral-analy.pl converts Coral-corrected FASTA file to TEF as
      below: 
     #+BEGIN_EXAMPLE
     $ coral-analy.pl corrected.fa all.fa coral-output.er > coral_conv.log
     #+END_EXAMPLE
      In the above example, corrected.fa is the corrected FASTA
      file, all.fa is the uncorrected FASTA file and
      coral-output.er is the output in TEF.
   2. Conversion program for both Quake and ECHO is
      quake-analy.py. It is run as below:
      #+BEGIN_EXAMPLE
      $ quake-analy.py -f all.fastq -c corrected.fastq -o echo-output.er -t echo-trim > missing.log
      #+END_EXAMPLE
      Here, `all.fastq' is the input file, `corrected.fastq' is the
      ECHO/Quake corrected fastq, `echo-output.er' is the output in
      TEF, and `echo-trim' is the list of reads with the
      trimmed area (which is ignored).
   3. Output from HiTEC is converted to TEF as below.
      #+BEGIN_EXAMPLE
      $ hitec-analy.pl corrected.fa all.fa hitec-output.er
      #+END_EXAMPLE
      Again, `all.fa' is the uncorrected FASTA, `corrected.fa' is the
      corrected FASTA and `hitec-output.er' is output from HiTEC.

   All these scripts exploit the identifiers given in FASTA/FASTQ
   headers added in pre-processing step (Section [[pre-process][Pre-processing Data]]).

** SAM to TEF Conversion
# <<sam-to-tef>>
Alignments in SAM file are converted to TEF file using the script 
`sam-analysis.py'.
#+BEGIN_EXAMPLE
sam-analysis.py --file=/path/to/sam-file-input
                --outfile=/path/to/err-output
                --ambig=/path/to/ambig-output
                --unmapped=/path/to/unmapped-output
                --trim=/path/to/trim-file-output
                [--genomeFile=/path/to/genome-file]
                [--dry (for dry run no output generated)]
#+END_EXAMPLE
`--outfile' option is a path of output file with write
access. Ambiguous reads are written to the file given as the value for
`--ambig' option. Unmapped reads are written to the output file
given as the value for `--unmapped' option. Unmapped and ambigous file
can be both same. trim-file-output positions trimmed (ranges allowed).

Here, genome file is optional. It is used if MD String is not 
available. If genome file is given, it will be loaded in memory
completely.  The script doesn't handle genomes with multiple
chromosomes.

** Comp2PCAlign
# <<comp2pacalign>>

Comp2PCAlign measures the Gain and Sensitivity from the outputs
generated in the previous two sub-sections. Usage is as below:
#+BEGIN_EXAMPLE
$ comp2pcalign [correction-rslt] [pre-correct-aln-rslt] [unmapped-pre-correct-aln] [m-value] [fpfn-rslt] [optional trimmed-file]
#+END_EXAMPLE
It takes 6 arguments and they are given in the following order :
1. Correction Result converted to TEF.
2. Alignment SAM converted to TEF.
3. File with list of unmapped reads.
4. Edit distance used for alignment.
5. Output file with write access to which the statistics are written
   to. 
6. [Optional] List of reads with trimmed regions.
(1) is generated from Error correction output as described in Section
[[tef-conversion][Conversion to TEF]]. (2),(3),(4) and (6) are generated from the
alignment as described in [[sam-to-tef][SAM to TEF Conversion]]. (3) is a
concatenation of both unmapped and ambiguous reads.

** Corrected 454/Ion Torrent Reads Analysis
# <<ion454-tools>>
The procedure to analyse 454/Ion Torrent Reads is given in the
paper. `compute-stats.py' is the script implementing the procedure.
It is used as below: 
#+BEGIN_EXAMPLE
compute-stats.py --aln=/path/to/pre-correction-alignment-sam-file
                --corrected=/path/to/corrected-reads-fa-file
                --outfile=/path/to/stats-output (write access reqd.)
                --records=number of reads
                [--genomeFile=/path/to/genome-file]
                [--band=value of k used for k-band alignment (default 5)]
              (OR)
compute-stats.py -a /path/to/pre-correction-alignment-sam-file
                -c /path/to/corrected-reads-fa-file
                -o /path/to/stats-output-file (write access reqd.)
                -r number of reads
                [-g /path/to/genome-file]
                [-b value of k used for k-band alignment (default 5)]

#+END_EXAMPLE
The script accepts only FASTA file. The script requires that the
FASTA is pre-processed as given in Section [[pre-process][Pre-processing Data]],
because it exploits the sorted identifiers to process SAM with FASTA
in a single pass. 

`--band' option gives the value of band size used for k-band
alignment. Here, genome file is optional. It is used if the MD String
is not  available. If genome file is given, it will be loaded in
memory completely.  The script doesn't handle genomes with multiple
chromosomes.

`compute-stats.py' requires MPI, and mpi4py as it is uses MPI.

