doc/ecet.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Pre-processing Data</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Short Read Archive have the reads in '.sra' format. '.sra'
format can be converted to fastq format using the 'fastq-dump'
tool available with NCBI SRA tool kit.
</li>
<li>We use FASTA format whenever possible. To convert FASTQ to
FASTA, the script 'fastq-converter-v2.0.pl' is used as follows.
<pre class="example">
$ fastq-converter-v2.0.pl fastq/ fasta/ 1
</pre>
<p>
Here, `fastq/' directory consists of all the fastq files
of the data-set are stored. Output is generated in the <code>fasta/</code> 
directory. The last argument `1' is supplied to ignore the reads
with `N' characters. `fastq-converter-v2.0.pl' generates unique
ids for each of the read and inserts in the FASTA header. The
read id is unique among all the files. These identifiers are used
to compare the reads pre- and post-correction with corresponding
identifiers. The order in which  `fastq-converter-v2.0.pl' does 
the conversion is saved. The identifiers are assigned to the
reads in this order from <b>0</b> to <b>n-1</b>, where <b>n</b> is the total
number of reads.  For example, for SRR001665 data-set the 
`fastq-converter-v2.0.pl' processes the fastq files in the
following order.
</p>
<pre class="example">
SRR001665_2.fastq
SRR001665.fastq
SRR001665_1.fastq
</pre>
<p>
Here, the first read in SRR001665\_2.fastq file gets the id <b>0</b>,
and the last read in SRR001665\_1.fastq has the id <b>n-1</b>.
</p>
</li>
<li>Some of the error correction methods use only accept FASTQ. In
order to make sure the read ids are same for all the error
correction methods, we use merge-fastq.py to provide
identifiers to FASTQ files. The script merges all FASTQ in a
given input list, so that the ids in the FASTQ can be compared
pre- and post-correction. merge-fastq.py is run as follows:
<pre class="example">
$ merge-fastq.py --list=lst --outfile=all.fastq
</pre>
<p>
where `lst' is a new line delimited file containing the paths to 
fastq files. For example, for SRR001665 data-set the `&#x2013;list'
argument is path to a file with the following contents:
</p>
<pre class="example">
SRR001665_2.fastq
SRR001665.fastq
SRR001665_1.fastq
</pre>
<p>
For the comparison to make sense, the order should be same as the
order in which FASTQ converter (`fastq-converter-v2.0.pl') did
the conversion. 
</p>
</li>
<li>While pre-processing, we ignore the reads with invalid characters
because some error correction programs can not work with
invalid characters.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Conversion to TEF</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Scripts for converting output to TEF are used as follows:
</p>
<ol class="org-ol">
<li>coral-analy.pl converts Coral-corrected FASTA file to TEF as
below: 
<pre class="example">
$ coral-analy.pl corrected.fa all.fa coral-output.er &gt; coral_conv.log
</pre>
<p>
In the above example, corrected.fa is the corrected FASTA
file, all.fa is the uncorrected FASTA file and
coral-output.er is the output in TEF.
</p>
</li>
<li>Conversion program for both Quake and ECHO is
quake-analy.py. It is run as below:
<pre class="example">
$ quake-analy.py -f all.fastq -c corrected.fastq -o echo-output.er -t echo-trim &gt; missing.log
</pre>
<p>
Here, `all.fastq' is the input file, `corrected.fastq' is the
ECHO/Quake corrected fastq, `echo-output.er' is the output in
TEF, and `echo-trim' is the list of reads with the
trimmed area (which is ignored).
</p>
</li>
<li>Output from HiTEC is converted to TEF as below.
<pre class="example">
$ hitec-analy.pl corrected.fa all.fa hitec-output.er
</pre>
<p>
Again, `all.fa' is the uncorrected FASTA, `corrected.fa' is the
corrected FASTA and `hitec-output.er' is output from HiTEC.
</p>
</li>
</ol>

<p>
All these scripts exploit the identifiers given in FASTA/FASTQ
headers added in pre-processing step (Section <i>Pre-processing Data</i>).
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> SAM to TEF Conversion</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Alignments in SAM file are converted to TEF file using the script 
`sam-analysis.py'.
</p>
<pre class="example">
sam-analysis.py --file=/path/to/sam-file-input
                --outfile=/path/to/err-output
                --ambig=/path/to/ambig-output
                --unmapped=/path/to/unmapped-output
                --trim=/path/to/trim-file-output
                [--genomeFile=/path/to/genome-file]
                [--dry (for dry run no output generated)]
</pre>
<p>
`&#x2013;outfile' option is a path of output file with write
access. Ambiguous reads are written to the file given as the value for
`&#x2013;ambig' option. Unmapped reads are written to the output file
given as the value for `&#x2013;unmapped' option. Unmapped and ambigous file
can be both same. trim-file-output positions trimmed (ranges allowed).
</p>

<p>
Here, genome file is optional. It is used if MD String is not 
available. If genome file is given, it will be loaded in memory
completely.  The script doesn't handle genomes with multiple
chromosomes.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Comp2PCAlign</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Comp2PCAlign measures the Gain and Sensitivity from the outputs
generated in the previous two sub-sections. Usage is as below:
</p>
<pre class="example">
$ comp2pcalign [correction-rslt] [pre-correct-aln-rslt] [unmapped-pre-correct-aln] [m-value] [fpfn-rslt] [optional trimmed-file]
</pre>
<p>
It takes 6 arguments and they are given in the following order :
</p>
<ol class="org-ol">
<li>Correction Result converted to TEF.
</li>
<li>Alignment SAM converted to TEF.
</li>
<li>File with list of unmapped reads.
</li>
<li>Edit distance used for alignment.
</li>
<li>Output file with write access to which the statistics are written
to. 
</li>
<li>[Optional] List of reads with trimmed regions.
</li>
</ol>
<p>
(1) is generated from Error correction output as described in Section
<i>Conversion to TEF</i>. (2),(3),(4) and (6) are generated from the
alignment as described in <i>SAM to TEF Conversion</i>. (3) is a
concatenation of both unmapped and ambiguous reads.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Corrected 454/Ion Torrent Reads Analysis</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The procedure to analyse 454/Ion Torrent Reads is given in the
paper. `compute-stats.py' is the script implementing the procedure.
It is used as below: 
</p>
<pre class="example">
compute-stats.py --aln=/path/to/pre-correction-alignment-sam-file
                --corrected=/path/to/corrected-reads-fa-file
                --outfile=/path/to/stats-output (write access reqd.)
                --records=number of reads
                [--genomeFile=/path/to/genome-file]
                [--band=value of k used for k-band alignment (default 5)]
              (OR)
compute-stats.py -a /path/to/pre-correction-alignment-sam-file
                -c /path/to/corrected-reads-fa-file
                -o /path/to/stats-output-file (write access reqd.)
                -r number of reads
                [-g /path/to/genome-file]
                [-b value of k used for k-band alignment (default 5)]
</pre>
<p>
The script accepts only FASTA file. The script requires that the
FASTA is pre-processed as given in Section <i>Pre-processing Data</i>,
because it exploits the sorted identifiers to process SAM with FASTA
in a single pass. 
</p>

<p>
`&#x2013;band' option gives the value of band size used for k-band
alignment. Here, genome file is optional. It is used if the MD String
is not  available. If genome file is given, it will be loaded in
memory completely.  The script doesn't handle genomes with multiple
chromosomes.
</p>

<p>
`compute-stats.py' requires MPI, and mpi4py as it is uses MPI.
</p>
</div>
</div>
</div>
